Repository: Senadheera-eng/civic_link
Catalog: lib/l10n/app_*.arb
Languages: si

# appTitle
source: CivicLink
si: සිවික්ලින්ක්

# appTagline
source: Report. Track. Resolve.
si: වාර්තා කරන්න. ට්‍රැක් කරන්න. විසඳන්න.

source: Welcome back!
si: නැවත පිළිගන්නවා!

source: Settings
si: සැකසුම්

# manageAccount
source: Manage your account and preferences
si: ඔබගේ ගිණුම සහ මනාපයන් කළමනාකරණය කරන්න

source: Profile Information
si: පැතිකඩ තොරතුරු

source: Account Settings
si: ගිණුම් සැකසුම්

source: Edit Profile
si: පැතිකඩ සංස්කරණය

# updatePersonalInfo
source: Update your personal information
si: ඔබගේ පුද්ගලික තොරතුරු යාවත්කාලීන කරන්න

source: Change Password
si: මුරපදය වෙනස් කරන්න

# updateAccountPassword
source: Update your account password
si: ඔබගේ ගිණුම් මුරපදය යාවත්කාලීන කරන්න

source: Email Preferences
si: ඊමේල් මනාපයන්

source: Manage email settings
si: ඊමේල් සැකසුම් කළමනාකරණය කරන්න

source: Notifications
si: දැනුම්දීම්

source: Enable Notifications
si: දැනුම්දීම් සක්‍රීය කරන්න

source: Receive app notifications
si: යෙදුම් දැනුම්දීම් ලබන්න

source: Email Notifications
si: ඊමේල් දැනුම්දීම්

source: Receive notifications via email
si: ඊමේල් හරහා දැනුම්දීම් ලබන්න

source: Push Notifications
si: තල්ලු දැනුම්දීම්

source: Receive push notifications
si: තල්ලු දැනුම්දීම් ලබන්න

source: App Preferences
si: යෙදුම් මනාපයන්

source: Language
si: භාෂාව

# choosePreferredLanguage
source: Choose your preferred language
si: ඔබගේ කැමති භාෂාව තෝරන්න

source: Dark Mode
si: අඳුරු මෝඩය

# switchTheme
source: Switch between light and dark theme
si: ආලෝකය සහ අඳුරු තේමාව අතර මාරු වන්න

source: Privacy & Security
si: පුද්ගලිකත්වය සහ ආරක්ෂාව

source: Location Services
si: ස්ථාන සේවා

# allowLocationAccess
source: Allow app to access your location
si: යෙදුමට ඔබගේ ස්ථානයට ප්‍රවේශ වීමට ඉඩ දෙන්න

# biometricAuth
source: Biometric Authentication
si: ජෛව මිතික සත්‍යාපනය

# useBiometric
source: Use fingerprint or face unlock
si: ඇඟිලි සලකුණු හෝ මුහුණු අගුලු භාවිතා කරන්න

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

# readPrivacyPolicy
source: Read our privacy policy
si: අපගේ පෞද්ගලිකත්ව ප්‍රතිපත්තිය කියවන්න

source: Export Data
si: දත්ත නිර්යාත කරන්න

# downloadAccountData
source: Download your account data
si: ඔබගේ ගිණුම් දත්ත බාගන්න

source: About & Support
si: පිළිබඳව සහ සහාය

source: Help & Support
si: උදව් සහ සහාය

# getHelpContact
source: Get help or contact support
si: උදව් ලබන්න හෝ සහායක කණ්ඩායම සම්බන්ධ කරන්න

source: About CivicLink
si: සිවික්ලින්ක් ගැන

# appVersionInfo
source: App version and information
si: යෙදුම් අනුවාදය සහ තොරතුරු

source: Rate App
si: යෙදුම අගයන්න

# rateCivicLinkStore
source: Rate CivicLink on app store
si: අයිතම වෙළඳසැලේ සිවික්ලින්ක් අගයන්න

source: Share App
si: යෙදුම බෙදාගන්න

# shareCivicLinkFriends
source: Share CivicLink with friends
si: මිතුරන් සමඟ සිවික්ලින්ක් බෙදාගන්න

source: Account Management
si: ගිණුම් කළමනාකරණය

source: Sign Out
si: ලොග් අවුට්

# signOutAccount
source: Sign out from your account
si: ඔබගේ ගිණුමෙන් ඉවත් වන්න

source: Delete Account
si: ගිණුම මකන්න

# permanentlyRemoveAccount
source: Permanently remove your account
si: ඔබගේ ගිණුම ස්ථිරවම ඉවත් කරන්න

source: Full Name
si: සම්පූර්ණ නම

source: Email
si: ඊමේල්

source: Email cannot be changed
si: ඊමේල් වෙනස් කළ නොහැක

source: Cancel
si: අවලංගු කරන්න

source: Save
si: සුරකින්න

source: OK
si: හරි

source: CITIZEN
si: පුරවැසියා

source: ADMIN
si: පරිපාලක

source: Loading Settings...
si: සැකසුම් පූරණය වේ...

source: Profile updated successfully!
si: පැතිකඩ සාර්ථකව යාවත්කාලීන විය!

source: Notification settings updated!
si: දැනුම්දීම් සැකසුම් යාවත්කාලීන විය!

source: App preferences updated!
si: යෙදුම් මනාපයන් යාවත්කාලීන විය!

source: Privacy settings updated!
si: පෞද්ගලිකත්ව සැකසුම් යාවත්කාලීන විය!

source: Failed to load settings
si: සැකසුම් පූරණය කිරීමට අසමත් විය

source: Failed to update settings
si: සැකසුම් යාවත්කාලීන කිරීමට අසමත් විය

source: Quick Overview
si: ඉක්මන් දළ විශ්ලේෂණය

source: Live
si: සජීවී

source: Resolved
si: විසඳා ඇත

source: Pending
si: අත්හිටුවා ඇත

source: This Month
si: මෙම මාසය

source: Quick Actions
si: ඉක්මන් ක්‍රියාමාර්ග

source: Report Issue
si: ගැටලුව වාර්තා කරන්න

source: Report new problems
si: නව ගැටලු වාර්තා කරන්න

source: Track Issues
si: ගැටලු නිරීක්ෂණය

source: Monitor your reports
si: ඔබගේ වාර්තා නිරීක්ෂණය කරන්න

source: Issue Map
si: ගැටලු සිතියම

source: View nearby issues
si: ආසන්න ගැටලු බලන්න

source: Stay updated
si: යාවත්කාලීනව සිටින්න

source: Recent Activity
si: මෑත ක්‍රියාකාරකම්

source: View All
si: සියල්ල බලන්න

# noIssuesReported
source: No issues reported yet
si: තවම ගැටලු වාර්තා වී නැත

# startReportingFirst
source: Start by reporting your first community issue
si: ඔබගේ පළමු ප්‍රජා ගැටලුව වාර්තා කිරීමෙන් ආරම්භ කරන්න

source: Loading CivicLink...
si: සිවික්ලින්ක් පූරණය වේ...
